In [1]:
import pandas as pd

In [2]:
df = pd.read_csv("agora.csv")

In [3]:
df.head()

   Marketing Spend  Administration  Transport     Area     Profit
0        114523.61       136897.80  471784.10    Dhaka  192261.83
1        162597.70       151377.59  443898.53      Ctg  191792.06
2        153441.51       101145.55  407934.54  Rangpur  191050.39
3        144372.41       118671.85  383199.62    Dhaka  182901.99
4        142107.34        91391.77  366168.42  Rangpur  166187.94

In [4]:
df.isnull().sum()

Marketing Spend    0
Administration     0
Transport          1
Area               0
Profit             0
dtype: int64

# Handle Null value

In [5]:
mean =df.Transport.mean()

In [6]:
df.Transport = df.Transport.fillna(mean)

In [7]:
df.isnull().sum()

Marketing Spend    0
Administration     0
Transport          0
Area               0
Profit             0
dtype: int64

# Encoding
### Encoding with Replace function Area column

In [8]:
df.Area.unique()

array(['Dhaka', 'Ctg', 'Rangpur'], dtype=object)

In [9]:
df.Area = df.Area.replace(["Dhaka","Ctg","Rangpur"],[1,0,2])

In [10]:
df.head()

   Marketing Spend  Administration  Transport  Area     Profit
0        114523.61       136897.80  471784.10     1  192261.83
1        162597.70       151377.59  443898.53     0  191792.06
2        153441.51       101145.55  407934.54     2  191050.39
3        144372.41       118671.85  383199.62     1  182901.99
4        142107.34        91391.77  366168.42     2  166187.94

### Normalization , Standardization other column

In [11]:
from sklearn.preprocessing import MinMaxScaler

In [12]:
m = MinMaxScaler()

In [13]:
df["Marketing Spend"]=  m.fit_transform(df[["Marketing Spend"]])

In [14]:
df.head()

   Marketing Spend  Administration  Transport  Area     Profit
0         0.692617       136897.80  471784.10     1  192261.83
1         0.983359       151377.59  443898.53     0  191792.06
2         0.927985       101145.55  407934.54     2  191050.39
3         0.873136       118671.85  383199.62     1  182901.99
4         0.859438        91391.77  366168.42     2  166187.94

In [15]:
df["Transport"] = m.fit_transform(df[["Transport"]])

In [16]:
df.head()

   Marketing Spend  Administration  Transport  Area     Profit
0         0.692617       136897.80   1.000000     1  192261.83
1         0.983359       151377.59   0.940893     0  191792.06
2         0.927985       101145.55   0.864664     2  191050.39
3         0.873136       118671.85   0.812235     1  182901.99
4         0.859438        91391.77   0.776136     2  166187.94

In [17]:
from sklearn.preprocessing import StandardScaler

In [18]:
S = StandardScaler()

In [19]:
df["Administration"] = S.fit_transform(df[["Administration"]])

In [20]:
df.head()

   Marketing Spend  Administration  Transport  Area     Profit
0         0.692617        0.560753   1.000000     1  192261.83
1         0.983359        1.082807   0.940893     0  191792.06
2         0.927985       -0.728257   0.864664     2  191050.39
3         0.873136       -0.096365   0.812235     1  182901.99
4         0.859438       -1.079919   0.776136     2  166187.94

# Label Encoding

In [21]:
import pandas as pd
df = pd.read_csv("agora.csv")

In [22]:
df.head()

   Marketing Spend  Administration  Transport     Area     Profit
0        114523.61       136897.80  471784.10    Dhaka  192261.83
1        162597.70       151377.59  443898.53      Ctg  191792.06
2        153441.51       101145.55  407934.54  Rangpur  191050.39
3        144372.41       118671.85  383199.62    Dhaka  182901.99
4        142107.34        91391.77  366168.42  Rangpur  166187.94

In [23]:
from sklearn.preprocessing import LabelEncoder

In [24]:
L = LabelEncoder()

In [25]:
df["Area"]= L.fit_transform(df[["Area"]])

C:\Users\Binu\anaconda3\lib\site-packages\sklearn\utils\validation.py:63: DataConversionWarning: A column-vector y was passed when a 1d array was expected. Please change the shape of y to (n_samples, ), for example using ravel().
  return f(*args, **kwargs)

In [26]:
df.head()

   Marketing Spend  Administration  Transport  Area     Profit
0        114523.61       136897.80  471784.10     1  192261.83
1        162597.70       151377.59  443898.53     0  191792.06
2        153441.51       101145.55  407934.54     2  191050.39
3        144372.41       118671.85  383199.62     1  182901.99
4        142107.34        91391.77  366168.42     2  166187.94

# One Hot Encoder

In [34]:
import pandas as pd
df = pd.read_csv("agora.csv")
df.head()

   Marketing Spend  Administration  Transport     Area     Profit
0        114523.61       136897.80  471784.10    Dhaka  192261.83
1        162597.70       151377.59  443898.53      Ctg  191792.06
2        153441.51       101145.55  407934.54  Rangpur  191050.39
3        144372.41       118671.85  383199.62    Dhaka  182901.99
4        142107.34        91391.77  366168.42  Rangpur  166187.94

In [35]:
new_area =pd.get_dummies(df["Area"])

In [37]:
new_area.head()

   Ctg  Dhaka  Rangpur
0    0      1        0
1    1      0        0
2    0      0        1
3    0      1        0
4    0      0        1

In [38]:
df = df.drop("Area" , axis=1)

In [42]:
df= pd.concat([df,new_area], axis=1)

In [44]:
df = df.drop("Rangpur", axis=1)

In [45]:
df.head()

   Marketing Spend  Administration  Transport     Profit  Ctg  Dhaka
0        114523.61       136897.80  471784.10  192261.83    0      1
1        162597.70       151377.59  443898.53  191792.06    1      0
2        153441.51       101145.55  407934.54  191050.39    0      0
3        144372.41       118671.85  383199.62  182901.99    0      1
4        142107.34        91391.77  366168.42  166187.94    0      0

# Ordinal Encoder

In [32]:
import pandas as pd
df = pd.read_csv("agora.csv")

In [33]:
df.head()

   Marketing Spend  Administration  Transport     Area     Profit
0        114523.61       136897.80  471784.10    Dhaka  192261.83
1        162597.70       151377.59  443898.53      Ctg  191792.06
2        153441.51       101145.55  407934.54  Rangpur  191050.39
3        144372.41       118671.85  383199.62    Dhaka  182901.99
4        142107.34        91391.77  366168.42  Rangpur  166187.94

In [34]:
df.Area.unique()

array(['Dhaka', 'Ctg', 'Rangpur'], dtype=object)

In [35]:
cities =["Dhaka","Ctg","Rangpur"]

In [36]:
from sklearn.preprocessing import OrdinalEncoder

In [37]:
O = OrdinalEncoder(categories=[cities])

In [38]:
df["Area"]= O.fit_transform(df[["Area"]])

In [40]:
df.head()

   Marketing Spend  Administration  Transport  Area     Profit
0        114523.61       136897.80  471784.10   0.0  192261.83
1        162597.70       151377.59  443898.53   1.0  191792.06
2        153441.51       101145.55  407934.54   2.0  191050.39
3        144372.41       118671.85  383199.62   0.0  182901.99
4        142107.34        91391.77  366168.42   2.0  166187.94